/* Nes::RESULT_ERR_GENERIC */
"An unexpected error has occurred, but the programmer has been too lazy to put in a more detailed message. This should never happen." = "An unexpected error has occurred, but the programmer has been too lazy to put in a more detailed message. This should never happen.";

/* Nes::RESULT_ERR_MISSING_BIOS */
"FDS games require the Famicom BIOS image to be present. The expected location is \"~/Library/Application Support/Bannister/Nestopia/BIOS ROMs/disksys.rom\". It is not included with the emulator; please do not ask me where to get this file." = "FDS games require the Famicom BIOS image to be present. The expected location is \"~/Library/Application Support/Bannister/Nestopia/BIOS ROMs/disksys.rom\". It is not included with the emulator; please do not ask me where to get this file.";

/* Nes::RESULT_ERR_UNSUPPORTED_VSSYSTEM */
"Nestopia does not support VS Dual System games." = "Nestopia does not support VS Dual System games.";

/* Nes::IMAGE_DATABASE_LOAD_ERROR */
"Nestopia was unable to load the image database. This should not happen." = "Nestopia was unable to load the image database. This should not happen.";

/* Nes::RESULT_ERR_CORRUPT_FILE */
"The selected file appears to be damaged and cannot be opened by Nestopia." = "The selected file appears to be damaged and cannot be opened by Nestopia.";

/* Nes::RESULT_WARN_BAD_DUMP */
"The selected file is a known bad dump. Emulation may not proceed as expected." = "The selected file is a known bad dump. Emulation may not proceed as expected.";

/* Nes::RESULT_WARN_ENCRYPTED_ROM */
"The selected file is encrypted. Emulation may not proceed as expected." = "The selected file is encrypted. Emulation may not proceed as expected.";

/* Nes::RESULT_ERR_INVALID_FILE */
"The selected file is in a format which Nestopia does not support at this time." = "The selected file is in a format which Nestopia does not support at this time.";

/* Nes::RESULT_ERR_UNSUPPORTED_MAPPER */
"This game uses a memory mapper which is not supported by Nestopia at this time." = "This game uses a memory mapper which is not supported by Nestopia at this time.";

/* Nes::RESULT_ERR_UNSUPPORTED_SOUND_CHIP */
"This NSF file uses a sound chip not supported by Nestopia at this time." = "This NSF file uses a sound chip not supported by Nestopia at this time.";

